БПКР/src/Documents/ОтчетПоВыплатамИУдержаниямПН/ОтчетПоВыплатамИУдержаниямПН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетПоВыплатамИУдержаниямПН</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Годовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>EnumRef.ВидыОтчетаПоНалогам</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Отчет</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтраны</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНалоговойРегистрации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодДохода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОДПН</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПН</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтчетГодовой</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодДохода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОДПН</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоВыплаченноДохода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаМатериальнойВыгоды</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПН</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПНСМатериальнойВыгоды</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БПКР/src/InformationRegisters/ДокументыФизическихЛиц/ДокументыФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыФизическихЛиц</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КемВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЯвляетсяДокументомУдостоверяющимЛичность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовФизическихЛиц</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/Enums/ВидыОтчетаПоНалогам/ВидыОтчетаПоНалогам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОтчетаПоНалогам</name>
  <enumValues>
    <name>Первоначальный</name>
  </enumValues>
  <enumValues>
    <name>Уточненный</name>
  </enumValues>
  <enumValues>
    <name>Ликвидационный</name>
  </enumValues>
</mdclass:Enum>

БПКР/src/Catalogs/ВидыДокументовФизическихЛиц/ВидыДокументовФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДокументовФизическихЛиц</name>
  <predefined>
    <items>
      <name>ВодительскоеУдостоверение</name>
      <description>Водительское удостоверение</description>
    </items>
    <items>
      <name>ВоенныйБилет</name>
      <description>Военный билет</description>
    </items>
    <items>
      <name>ДипломатическийПаспорт</name>
      <description>Дипломатический паспорт гражданина</description>
    </items>
    <items>
      <name>Загранпаспорт</name>
      <description>Загранпаспорт гражданина</description>
    </items>
    <items>
      <name>Паспорт</name>
      <description>Паспорт</description>
    </items>
    <items>
      <name>СвидетельствоОРождении</name>
      <description>Свидетельство о рождении</description>
    </items>
  </predefined>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

БПКР/src/Documents/ОтчетПоВыплатамИУдержаниямПН/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Функция -ПолучитьКонтактнуюИнформацию
//
// Параметры:
//  Организация  - Спр.Ссылка - Спр.Организации 
// Возвращаемое значение:
//  Структура   - структура данных контактной информации
//
Функция ПолучитьКонтактнуюИнформацию(Организация)
	
	СведенияОбОрганизации = БухгалтерскийУчетСервер.ПолучитьСведенияОбОрганизации(Организация);
	
	ГородНасПункт = СведенияОбОрганизации.Город;
	АдрОбластьГород = ?(СведенияОбОрганизации.Регион = "","",СведенияОбОрганизации.Регион + ",")
	+ ?(СведенияОбОрганизации.Район  = "","", " " + СведенияОбОрганизации.Район + ",") 
		+ ?(ГородНасПункт = "",""," " + ГородНасПункт); 
	АдресОрганизации = ?(СведенияОбОрганизации.Улица    = "","",СведенияОбОрганизации.Улица + ",")
		+ ?(СведенияОбОрганизации.Дом      = "",""," " + СведенияОбОрганизации.Дом + ",")
		+ ?(СведенияОбОрганизации.Корпус   = "",""," " + СведенияОбОрганизации.Корпус + ",")
		+ ?(СведенияОбОрганизации.Квартира = "",""," " + СведенияОбОрганизации.Квартира);
		
	Телефон							= СведенияОбОрганизации.Тел;
	ЭлПочта 						= СведенияОбОрганизации.Email;
	ОКПО              				= СведенияОбОрганизации.ОКПО;
	ИНН 							= СведенияОбОрганизации.ИНН;
	ГНСНаименование                 = СведенияОбОрганизации.ГНСНаименование;
	ГНСКод 							= СведенияОбОрганизации.ГНСКод;
	ОрганизацияНаименованиеПолное   = СведенияОбОрганизации.НаименованиеПолное;
	Индекс  						= СведенияОбОрганизации.Индекс;

	Структура = Новый Структура();
	Структура.Вставить("ИНН", ИНН);
	Структура.Вставить("ОКПО", ОКПО);
	Структура.Вставить("ГНСКод", ГНСКод);
	Структура.Вставить("Индекс", Индекс);
	Структура.Вставить("Телефон", Телефон);
	Структура.Вставить("ЭлПочта", ЭлПочта);
	Структура.Вставить("АдрОбластьГород", АдрОбластьГород);
	Структура.Вставить("ГНСНаименование", ГНСНаименование);
	Структура.Вставить("АдресОрганизации", АдресОрганизации);
	Структура.Вставить("ОрганизацияНаименованиеПолное", ОрганизацияНаименованиеПолное);
	
	Возврат Структура;
	
КонецФункции // ПолучитьКонтактнуюИнформацию()

Функция НоваяСтруктураПараметровИННФЛ()
	
	СтруктураПараметровИННФЛ = Новый Структура;
	СтруктураПараметровИННФЛ.Вставить("ИНН1", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН2", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН3", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН4", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН5", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН6", "");		
	СтруктураПараметровИННФЛ.Вставить("ИНН7", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН8", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН9", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН10", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН11", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН12", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН13", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН14", "");	

	Возврат СтруктураПараметровИННФЛ;
	
КонецФункции 

// Функция - рассчитывает количество листов приложения STI 17-001
//
// Параметры:
// 	Период - Дата - дата документа
// 	ТаблицаДанных - ТаблицаЗначений - таблица с данными табличной части документа
// Возвращаемое значение:
//  Структура - количество листов приложения и таблица паспортных данных
//		*КоличествоЛистов - Число - количество листов приложения
//		*ТаблицаПаспортныхДанных - ТаблицаЗначений - таблица паспортных данных физ лиц
//
Функция КоличествоЛистовПриложенияSTI_17(Период, ТаблицаДанных)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаФизЛиц.ФизЛицоСсылка КАК ФизЛицо
		|ПОМЕСТИТЬ ВременнаяТаблицаФизЛица
		|ИЗ
		|	&ТаблицаФизЛиц КАК ТаблицаФизЛиц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыФизическихЛицСрезПервых.ФизЛицо КАК ФизЛицо,
		|	ДокументыФизическихЛицСрезПервых.Серия КАК Серия,
		|	ДокументыФизическихЛицСрезПервых.Номер КАК Номер,
		|	ДокументыФизическихЛицСрезПервых.ДатаВыдачи КАК ДатаВыдачи,
		|	ДокументыФизическихЛицСрезПервых.КемВыдан КАК КемВыдан
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
		|			&Период,
		|			ФизЛицо В
		|					(ВЫБРАТЬ
		|						ВременнаяТаблицаФизЛица.ФизЛицо
		|					ИЗ
		|						ВременнаяТаблицаФизЛица)
		|				И ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.Паспорт)) КАК ДокументыФизическихЛицСрезПервых";	
	Запрос.УстановитьПараметр("Период", 		Период);
	Запрос.УстановитьПараметр("ТаблицаФизЛиц", 	ТаблицаДанных);
	
	ТаблицаПаспортныхДанных = Запрос.Выполнить().Выгрузить();
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоВыплатамИУдержаниямПН.ПФ_MXL_STI_017_2Страница");	

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ОбластьЗаголовок 	= Макет.ПолучитьОбласть("ЗаголовокЛ2");
	ОбластьШапка 		= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаОтчета = Макет.ПолучитьОбласть("СтрокаОтчета");
	ОбластьИтого 		= Макет.ПолучитьОбласть("Итого");
	ОбластьВсего 		= Макет.ПолучитьОбласть("Всего");
	ОбластьПодвал 		= Макет.ПолучитьОбласть("Подвал");
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	МассивОбластей = Новый Массив();
	МассивОбластей.Добавить(ОбластьПодвал);
	МассивОбластей.Добавить(ОбластьИтого);
	
	КоличествоСтрок = ТаблицаДанных.Количество();
	
	ДанныеПечати = Новый Структура();
	ДанныеПечати.Вставить("ПаспортныеДанные", "");
	
	НомерСтроки = 1;
	КоличествоЛистов = 1;
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		ПаспортныеДанные = ТаблицаПаспортныхДанных.Найти(СтрокаТаблицы.ФизЛицоСсылка, "ФизЛицо");
		
		Если ПаспортныеДанные = Неопределено Тогда
			ДанныеПечати.ПаспортныеДанные = "";	
		Иначе
			ДанныеПечати.ПаспортныеДанные = СтрШаблон("%1, %2, %3, %4", 
											ПаспортныеДанные.Серия, 
											ПаспортныеДанные.Номер, 
											Формат(ПаспортныеДанные.ДатаВыдачи, "ДЛФ=D"), 
											ПаспортныеДанные.КемВыдан);
		КонецЕсли;	

		ОбластьСтрокаОтчета.Параметры.Заполнить(ДанныеПечати);
		ОбластьСтрокаОтчета.Параметры.Заполнить(СтрокаТаблицы);
		
		Если НомерСтроки = КоличествоСтрок Тогда
			МассивОбластей.Удалить(МассивОбластей.Количество() - 1);
			МассивОбластей.Добавить(ОбластьВсего);
		КонецЕсли;
		
		МассивОбластей.Добавить(ОбластьСтрокаОтчета);

		Если ТабличныйДокумент.ПроверитьВывод(МассивОбластей) Тогда
			ТабличныйДокумент.Вывести(ОбластьСтрокаОтчета);
			
		Иначе
			Если НомерСтроки = КоличествоСтрок Тогда
				ТабличныйДокумент.Вывести(ОбластьВсего);
			Иначе
				ТабличныйДокумент.Вывести(ОбластьИтого);
			КонецЕсли;	
			
			ТабличныйДокумент.Вывести(ОбластьПодвал);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			// Начало новой страницы
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			ТабличныйДокумент.Вывести(ОбластьСтрокаОтчета);
			
			КоличествоЛистов = КоличествоЛистов + 1;
		КонецЕсли;
		
		МассивОбластей.Удалить(МассивОбластей.Количество() - 1);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	ВозвращаемыеДанные = Новый Структура();
	ВозвращаемыеДанные.Вставить("КоличествоЛистов", КоличествоЛистов);
	ВозвращаемыеДанные.Вставить("ТаблицаПаспортныхДанных", ТаблицаПаспортныхДанных);
	
	Возврат ВозвращаемыеДанные;
КонецФункции

#КонецОбласти

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
//@skip-warning
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ИнтерфейсПечати

Функция ПечатьSTI_017_1Страница(МассивОбъектов, ОбъектыПечати)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка,
		|	ТаблицаДокумента.Номер,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.ДатаНачала,
		|	ТаблицаДокумента.ВидОтчета,
		|	ТаблицаДокумента.ДатаОкончания,
		|	ТаблицаДокумента.Отчет.(
		|		ФизЛицо КАК ФизЛицоСсылка,
		|		ФизЛицо.ФИО КАК ФизЛицо,
		|		КодСтраны,
		|		КодДохода,
		|		НомерНалоговойРегистрации,
		|		ОДПН,
		|		СуммаПН
		|	)
		|ИЗ
		|	Документ.ОтчетПоВыплатамИУдержаниямПН КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";
	Запрос = Новый Запрос(ТекстЗапроса);	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_STI_017_1Страница";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоВыплатамИУдержаниямПН.ПФ_MXL_STI_017_1Страница");
	
	Пока Шапка.Следующий() Цикл
		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Подготовка данных
		ДанныеПечати = Новый Структура;	
		
		// Контактные данные
		КонтактныеДанные = ПолучитьКонтактнуюИнформацию(Шапка.Организация);

		// Шапка титульного листа
		ДанныеПечати.Вставить("НаименованиеОрганизации", СокрЛП(КонтактныеДанные.ОрганизацияНаименованиеПолное));
		
		ГНСКод = КонтактныеДанные.ГНСКод;
		ДанныеПечати.Вставить("ГНС1", Сред(Строка(ГНСКод),1,1));
		ДанныеПечати.Вставить("ГНС2", Сред(Строка(ГНСКод),2,1));
		ДанныеПечати.Вставить("ГНС3", Сред(Строка(ГНСКод),3,1));
		
		ДанныеПечати.Вставить("НаименованиеНалоговой", КонтактныеДанные.ГНСНаименование);
		
		ОКПО = КонтактныеДанные.ОКПО;
		ДанныеПечати.Вставить("ОКПО1", Сред(Строка(ОКПО),1,1));
		ДанныеПечати.Вставить("ОКПО2", Сред(Строка(ОКПО),2,1));
		ДанныеПечати.Вставить("ОКПО3", Сред(Строка(ОКПО),3,1));
		ДанныеПечати.Вставить("ОКПО4", Сред(Строка(ОКПО),4,1));
		ДанныеПечати.Вставить("ОКПО5", Сред(Строка(ОКПО),5,1));
		ДанныеПечати.Вставить("ОКПО6", Сред(Строка(ОКПО),6,1));
		ДанныеПечати.Вставить("ОКПО7", Сред(Строка(ОКПО),7,1));
		ДанныеПечати.Вставить("ОКПО8", Сред(Строка(ОКПО),8,1));
		
		ДанныеПечати.Вставить("ЮрАдрес", КонтактныеДанные.АдресОрганизации);		
		ДанныеПечати.Вставить("Телефон", КонтактныеДанные.Телефон);
		ДанныеПечати.Вставить("ЭлПочта", КонтактныеДанные.ЭлПочта);
		ДанныеПечати.Вставить("АдресГород", КонтактныеДанные.АдрОбластьГород);		
		
		Индекс = КонтактныеДанные.Индекс;
		
		Если ЗначениеЗаполнено(Индекс) Тогда
			ДанныеПечати.Вставить("ИНД1", Сред(Индекс,1,1));
			ДанныеПечати.Вставить("ИНД2", Сред(Индекс,2,1));
			ДанныеПечати.Вставить("ИНД3", Сред(Индекс,3,1));
			ДанныеПечати.Вставить("ИНД4", Сред(Индекс,4,1));
			ДанныеПечати.Вставить("ИНД5", Сред(Индекс,5,1));
			ДанныеПечати.Вставить("ИНД6", Сред(Индекс,6,1));			
		КонецЕсли;
		
		//ИНН
		ИНН = КонтактныеДанные.ИНН;
		ДанныеПечати.Вставить("ИНН1", Сред(Строка(ИНН),1,1));
		ДанныеПечати.Вставить("ИНН2", Сред(Строка(ИНН),2,1));
		ДанныеПечати.Вставить("ИНН3", Сред(Строка(ИНН),3,1));
		ДанныеПечати.Вставить("ИНН4", Сред(Строка(ИНН),4,1));
		ДанныеПечати.Вставить("ИНН5", Сред(Строка(ИНН),5,1));
		ДанныеПечати.Вставить("ИНН6", Сред(Строка(ИНН),6,1));
		ДанныеПечати.Вставить("ИНН7", Сред(Строка(ИНН),7,1));
		ДанныеПечати.Вставить("ИНН8", Сред(Строка(ИНН),8,1));
		ДанныеПечати.Вставить("ИНН9", Сред(Строка(ИНН),9,1));
		ДанныеПечати.Вставить("ИНН10", Сред(Строка(ИНН),10,1));
		ДанныеПечати.Вставить("ИНН11", Сред(Строка(ИНН),11,1));
		ДанныеПечати.Вставить("ИНН12", Сред(Строка(ИНН),12,1));
		ДанныеПечати.Вставить("ИНН13", Сред(Строка(ИНН),13,1));
		ДанныеПечати.Вставить("ИНН14", Сред(Строка(ИНН),14,1));
				
		ДанныеПечати.Вставить("Квартал");
		
		// Период квартал
		Если Месяц(Шапка.ДатаОкончания) = 3 Тогда
			ДанныеПечати.Квартал = "1";
		ИначеЕсли Месяц(Шапка.ДатаОкончания) = 6 Тогда
			ДанныеПечати.Квартал = "2";
		ИначеЕсли Месяц(Шапка.ДатаОкончания) = 9 Тогда
			ДанныеПечати.Квартал = "3";
		ИначеЕсли Месяц(Шапка.ДатаОкончания) = 12 Тогда
			ДанныеПечати.Квартал = "4";
		КонецЕсли;
		
		// Налоговый период за год
		ДанныеПечати.Вставить("ГОД_1", Сред(Формат(Год(Шапка.ДатаОкончания),"ЧЦ=4; ЧГ=0"),1,1));
		ДанныеПечати.Вставить("ГОД_2", Сред(Формат(Год(Шапка.ДатаОкончания),"ЧЦ=4; ЧГ=0"),2,1));
		ДанныеПечати.Вставить("ГОД_3", Сред(Формат(Год(Шапка.ДатаОкончания),"ЧЦ=4; ЧГ=0"),3,1));
		ДанныеПечати.Вставить("ГОД_4", Сред(Формат(Год(Шапка.ДатаОкончания),"ЧЦ=4; ЧГ=0"),4,1));
		
		// Номера страниц
		ДанныеПечати.Вставить("КолЛист1");
		ДанныеПечати.Вставить("КолЛист2");
		ДанныеПечати.Вставить("КолЛист3");
		
		ТаблицаДокумента = Шапка.Отчет.Выгрузить();
		КоличествоЛистов = КоличествоЛистовПриложенияSTI_17(Шапка.ДатаНачала, ТаблицаДокумента).КоличествоЛистов;
		КоличествоЛистовСтрокой = Строка(КоличествоЛистов);
		
		Если  СтрДлина(КоличествоЛистовСтрокой) = 1 Тогда
			ДанныеПечати.КолЛист3 = Сред(КоличествоЛистовСтрокой,1,1);			
		ИначеЕсли СтрДлина(КоличествоЛистовСтрокой) = 2 Тогда
			ДанныеПечати.КолЛист3 = Сред(КоличествоЛистовСтрокой,2,1);
			ДанныеПечати.КолЛист2 = Сред(КоличествоЛистовСтрокой,1,1);	
		ИначеЕсли СтрДлина(КоличествоЛистовСтрокой) = 3 Тогда
			ДанныеПечати.КолЛист3 = Сред(КоличествоЛистовСтрокой,3,1);
			ДанныеПечати.КолЛист2 = Сред(КоличествоЛистовСтрокой,2,1);
			ДанныеПечати.КолЛист1 = Сред(КоличествоЛистовСтрокой,1,1);
		КонецЕсли;
		
		ДанныеПечати.Вставить("ОДПН", ТаблицаДокумента.Итог("ОДПН"));
		ДанныеПечати.Вставить("СуммаПН", ТаблицаДокумента.Итог("СуммаПН"));
		
		Если Шапка.ВидОтчета = Перечисления.ВидыОтчетаПоНалогам.Первоначальный Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокПервоначальная");
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокУточненная");
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЕсли;	
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры,ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);		
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции 

Функция ПечатьSTI_017_2Страница(МассивОбъектов, ОбъектыПечати)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Ссылка,
		|	ТаблицаДокумента.Номер КАК Номер,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.ДатаНачала КАК ДатаНачала,
		|	ТаблицаДокумента.ДатаОкончания КАК ДатаОкончания,
		|	ТаблицаДокумента.Организация.ИНН КАК ИНН,
		|	ТаблицаДокумента.Организация.КодПоОКПО КАК КодПоОКПО,
		|	ТаблицаДокумента.Организация.ГНС.Наименование КАК ГНСНаименование,
		|	ТаблицаДокумента.Организация.ГНС.Код КАК ГНСКод,
		|	ТаблицаДокумента.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	ТаблицаДокумента.Отчет.(
		|		ФизЛицо КАК ФизЛицоСсылка,
		|		ФизЛицо.ФИО КАК ФизЛицо,
		|		КодСтраны КАК КодСтраны,
		|		НомерНалоговойРегистрации КАК НомерНалоговойРегистрации,
		|		КодДохода КАК КодДохода,
		|		ОДПН КАК ОДПН,
		|		СуммаПН КАК СуммаПН
		|	) КАК Отчет
		|ИЗ
		|	Документ.ОтчетПоВыплатамИУдержаниямПН КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";

	Запрос = Новый Запрос(ТекстЗапроса);	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_STI_017_2Страница";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоВыплатамИУдержаниямПН.ПФ_MXL_STI_017_2Страница");
	
	Пока Шапка.Следующий() Цикл
		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Подготовка данных
		ДанныеПечати = Новый Структура;	
		ДанныеПечати.Вставить("КолЛист3");
		
		ОбластьЗаголовокЛ2 	= Макет.ПолучитьОбласть("ЗаголовокЛ2");	
		ОбластьЗаголовокЛЗ 	= Макет.ПолучитьОбласть("ЗаголовокЛЗ");	
		ОбластьШапка 		= Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока		= Макет.ПолучитьОбласть("СтрокаОтчета");
		ОбластьПодвал 		= Макет.ПолучитьОбласть("Подвал");
		ОбластьИтого 		= Макет.ПолучитьОбласть("Итого");
		ОбластьВсего 		= Макет.ПолучитьОбласть("Всего");
		
		ТаблицаДокумента 		= Шапка.Отчет.Выгрузить();		
		ДанныеПриложения 		= КоличествоЛистовПриложенияSTI_17(Шапка.ДатаНачала, ТаблицаДокумента);		
		КоличествоЛистов 		= ДанныеПриложения.КоличествоЛистов; 
		ТаблицаПаспортныхДанных = ДанныеПриложения.ТаблицаПаспортныхДанных;
		
		// Заголовок стр. 2	
		НомерЛиста = 1;
		
		Если НомерЛиста = КоличествоЛистов Тогда
			ДанныеПечати.КолЛист3 = НомерЛиста;
			ОбластьЗаголовокЛЗ.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьЗаголовокЛЗ);
		Иначе 
			ДанныеПечати.КолЛист3 = НомерЛиста;
			ОбластьЗаголовокЛ2.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьЗаголовокЛ2);		
		КонецЕсли;

		// Заполнение шапки
		ДанныеПечати.Вставить("НаименованиеОрганизации", СокрЛП(Шапка.ОрганизацияНаименованиеПолное));
		
		ГНСКод = Шапка.ГНСКод;
		ДанныеПечати.Вставить("ГНС1", Сред(Строка(ГНСКод),1,1));
		ДанныеПечати.Вставить("ГНС2", Сред(Строка(ГНСКод),2,1));
		ДанныеПечати.Вставить("ГНС3", Сред(Строка(ГНСКод),3,1));
		
		ДанныеПечати.Вставить("НаименованиеНалоговой", Шапка.ГНСНаименование);
		
		ОКПО = Шапка.КодПоОКПО;
		ДанныеПечати.Вставить("ОКПО1", Сред(Строка(ОКПО),1,1));
		ДанныеПечати.Вставить("ОКПО2", Сред(Строка(ОКПО),2,1));
		ДанныеПечати.Вставить("ОКПО3", Сред(Строка(ОКПО),3,1));
		ДанныеПечати.Вставить("ОКПО4", Сред(Строка(ОКПО),4,1));
		ДанныеПечати.Вставить("ОКПО5", Сред(Строка(ОКПО),5,1));
		ДанныеПечати.Вставить("ОКПО6", Сред(Строка(ОКПО),6,1));
		ДанныеПечати.Вставить("ОКПО7", Сред(Строка(ОКПО),7,1));
		ДанныеПечати.Вставить("ОКПО8", Сред(Строка(ОКПО),8,1));
				
		//ИНН
		ИНН = Шапка.ИНН;
		ДанныеПечати.Вставить("ИНН1", Сред(Строка(ИНН),1,1));
		ДанныеПечати.Вставить("ИНН2", Сред(Строка(ИНН),2,1));
		ДанныеПечати.Вставить("ИНН3", Сред(Строка(ИНН),3,1));
		ДанныеПечати.Вставить("ИНН4", Сред(Строка(ИНН),4,1));
		ДанныеПечати.Вставить("ИНН5", Сред(Строка(ИНН),5,1));
		ДанныеПечати.Вставить("ИНН6", Сред(Строка(ИНН),6,1));
		ДанныеПечати.Вставить("ИНН7", Сред(Строка(ИНН),7,1));
		ДанныеПечати.Вставить("ИНН8", Сред(Строка(ИНН),8,1));
		ДанныеПечати.Вставить("ИНН9", Сред(Строка(ИНН),9,1));
		ДанныеПечати.Вставить("ИНН10", Сред(Строка(ИНН),10,1));
		ДанныеПечати.Вставить("ИНН11", Сред(Строка(ИНН),11,1));
		ДанныеПечати.Вставить("ИНН12", Сред(Строка(ИНН),12,1));
		ДанныеПечати.Вставить("ИНН13", Сред(Строка(ИНН),13,1));
		ДанныеПечати.Вставить("ИНН14", Сред(Строка(ИНН),14,1));
		
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		// Вывод таблицы
		ДанныеПечати.Вставить("ИтогоОДПН", 		0);
		ДанныеПечати.Вставить("ИтогоСуммаПН", 	0);
		ДанныеПечати.Вставить("ВсегоОДПН", 		0);
		ДанныеПечати.Вставить("ВсегоСуммаПН", 	0);
		ДанныеПечати.Вставить("ПаспортныеДанные","");
		ДанныеПечати.Вставить("КодСтраны1","");
		ДанныеПечати.Вставить("КодСтраны2","");
		ДанныеПечати.Вставить("КодСтраны3","");
		ДанныеПечати.Вставить("КолЛист1", "");
		ДанныеПечати.Вставить("КолЛист2", "");
		ДанныеПечати.Вставить("КолЛист3", "");
		
		КоличествоСтрок = ТаблицаДокумента.Количество();
		НомерСтроки = 1;
		
		МассивОбластей = Новый Массив();
		МассивОбластей.Добавить(ОбластьПодвал);
		МассивОбластей.Добавить(ОбластьИтого);
		
		Для Каждого СтрокаТаблицы Из ТаблицаДокумента Цикл
			
			ПаспортныеДанные = ТаблицаПаспортныхДанных.Найти(СтрокаТаблицы.ФизЛицоСсылка, "ФизЛицо");
		
			Если ПаспортныеДанные = Неопределено Тогда
				ДанныеПечати.ПаспортныеДанные = "";	
			Иначе
				ДанныеПечати.ПаспортныеДанные = СтрШаблон("%1, %2, %3, %4", 
												ПаспортныеДанные.Серия, 
												ПаспортныеДанные.Номер, 
												Формат(ПаспортныеДанные.ДатаВыдачи, "ДЛФ=D"), 
												ПаспортныеДанные.КемВыдан);
			КонецЕсли;	

			Если ЗначениеЗаполнено(СтрокаТаблицы.КодСтраны) Тогда 	
				ДанныеПечати.КодСтраны1 = Сред(Строка(СтрокаТаблицы.КодСтраны),1,1);
				ДанныеПечати.КодСтраны2 = Сред(Строка(СтрокаТаблицы.КодСтраны),2,1);
				ДанныеПечати.КодСтраны3 = Сред(Строка(СтрокаТаблицы.КодСтраны),3,1);
			Иначе
				ДанныеПечати.КодСтраны1 = "";
				ДанныеПечати.КодСтраны2 = "";
				ДанныеПечати.КодСтраны3 = "";
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Заполнить(ДанныеПечати);
			ОбластьСтрока.Параметры.Заполнить(СтрокаТаблицы);
			
			Если НомерСтроки = КоличествоСтрок Тогда
				МассивОбластей.Удалить(МассивОбластей.Количество() - 1);
				МассивОбластей.Добавить(ОбластьВсего);
			КонецЕсли;
			
			МассивОбластей.Добавить(ОбластьСтрока);

			Если ТабличныйДокумент.ПроверитьВывод(МассивОбластей) Тогда
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				
			Иначе
				Если НомерСтроки = КоличествоСтрок Тогда
					ОбластьВсего.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьВсего);
				Иначе
					ОбластьИтого.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьИтого);
					
					ДанныеПечати.ИтогоОДПН 		= 0;
					ДанныеПечати.ИтогоСуммаПН 	= 0; 
				КонецЕсли;	
				
				ТабличныйДокумент.Вывести(ОбластьПодвал);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
				// Начало новой страницы
				НомерЛиста = НомерЛиста + 1;
				
				ДанныеПечати.КолЛист1 = "";
				ДанныеПечати.КолЛист2 = "";
				ДанныеПечати.КолЛист3 = "";
				
				Если НомерЛиста = КоличествоЛистов Тогда
					стрНомерЛиста =  Строка(НомерЛиста);
					Если СтрДлина(стрНомерЛиста) = 1 Тогда
						ДанныеПечати.КолЛист3 = Сред(стрНомерЛиста,1,1);
					ИначеЕсли СтрДлина(стрНомерЛиста) = 2 Тогда
						ДанныеПечати.КолЛист2 = Сред(стрНомерЛиста,1,1);
						ДанныеПечати.КолЛист3 = Сред(стрНомерЛиста,2,1);
					ИначеЕсли СтрДлина(стрНомерЛиста) = 3 Тогда
						ДанныеПечати.КолЛист1 = Сред(стрНомерЛиста,1,1);
						ДанныеПечати.КолЛист2 = Сред(стрНомерЛиста,2,1);
						ДанныеПечати.КолЛист3 = Сред(стрНомерЛиста,3,1);
					КонецЕсли;		
					ОбластьЗаголовокЛЗ.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьЗаголовокЛЗ);
					ОбластьШапка.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьШапка);
					
				Иначе 
					стрНомерЛиста =  Строка(НомерЛиста);
					Если СтрДлина(стрНомерЛиста) = 1 Тогда
						ДанныеПечати.КолЛист3 = Сред(стрНомерЛиста,1,1);
					ИначеЕсли СтрДлина(стрНомерЛиста) = 2 Тогда
						ДанныеПечати.КолЛист2 = Сред(стрНомерЛиста,1,1);
						ДанныеПечати.КолЛист3 = Сред(стрНомерЛиста,2,1);
					ИначеЕсли СтрДлина(стрНомерЛиста) = 3 Тогда
						ДанныеПечати.КолЛист1 = Сред(стрНомерЛиста,1,1);
						ДанныеПечати.КолЛист2 = Сред(стрНомерЛиста,2,1);
						ДанныеПечати.КолЛист3 = Сред(стрНомерЛиста,3,1);
					КонецЕсли;	
					ОбластьЗаголовокЛ2.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьЗаголовокЛ2);
					ОбластьШапка.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьШапка);
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				
				НомерСтроки = НомерСтроки + 1;
			КонецЕсли;
			
			ДанныеПечати.ИтогоОДПН 		= ДанныеПечати.ИтогоОДПН + СтрокаТаблицы.ОДПН;
			ДанныеПечати.ИтогоСуммаПН 	= ДанныеПечати.ИтогоСуммаПН + СтрокаТаблицы.СуммаПН;
			ДанныеПечати.ВсегоОДПН 		= ДанныеПечати.ВсегоОДПН + СтрокаТаблицы.ОДПН;
			ДанныеПечати.ВсегоСуммаПН 	= ДанныеПечати.ВсегоСуммаПН + СтрокаТаблицы.СуммаПН;
			
			МассивОбластей.Удалить(МассивОбластей.Количество() - 1);
		КонецЦикла;	
		
		ЛистНеЗаполненДоКонца = Истина;
		
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаОтчета");
		
		МассивОбластей = Новый Массив();
		МассивОбластей.Добавить(ОбластьПодвал);
		МассивОбластей.Добавить(ОбластьВсего);
		МассивОбластей.Добавить(ОбластьСтрока);
		
		Пока ЛистНеЗаполненДоКонца Цикл
			
			Если ТабличныйДокумент.ПроверитьВывод(МассивОбластей) Тогда
				ТабличныйДокумент.Вывести(ОбластьСтрока);
			Иначе
				ОбластьВсего.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьВсего);
				ТабличныйДокумент.Вывести(ОбластьПодвал);
				
				ЛистНеЗаполненДоКонца = Ложь;
			КонецЕсли;	
		КонецЦикла;	
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

Функция ПечатьSTI_058_1Страница(МассивОбъектов, ОбъектыПечати)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка,
		|	ТаблицаДокумента.Номер,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.ВидОтчета,
		|	ТаблицаДокумента.ДатаНачала,
		|	ТаблицаДокумента.ДатаОкончания,
		|	ТаблицаДокумента.ОтчетГодовой.(
		|		НомерСтроки,
		|		ФизЛицо,
		|		ИНН,
		|		ВсегоВыплаченноДохода,
		|		СуммаМатериальнойВыгоды,
		|		СуммаПН,
		|		СуммаПНСМатериальнойВыгоды
		|	)
		|ИЗ
		|	Документ.ОтчетПоВыплатамИУдержаниямПН КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";

	Запрос = Новый Запрос(ТекстЗапроса);	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_STI_058_1Страница";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоВыплатамИУдержаниямПН.ПФ_MXL_STI_058_1Страница");
	
	Пока Шапка.Следующий() Цикл
		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Подготовка данных
		ДанныеПечати = Новый Структура;	
		
		// Контактные данные
		КонтактныеДанные = ПолучитьКонтактнуюИнформацию(Шапка.Организация);
		
		// Шапка титульного листа
		ДанныеПечати.Вставить("НаименованиеОрганизации", СокрЛП(КонтактныеДанные.ОрганизацияНаименованиеПолное));
		
		ГНСКод = КонтактныеДанные.ГНСКод;
		ДанныеПечати.Вставить("ГНС1", Сред(Строка(ГНСКод),1,1));
		ДанныеПечати.Вставить("ГНС2", Сред(Строка(ГНСКод),2,1));
		ДанныеПечати.Вставить("ГНС3", Сред(Строка(ГНСКод),3,1));
		
		ДанныеПечати.Вставить("НаименованиеНалоговой", КонтактныеДанные.ГНСНаименование);
		
		ОКПО = КонтактныеДанные.ОКПО;
		ДанныеПечати.Вставить("ОКПО1", Сред(Строка(ОКПО),1,1));
		ДанныеПечати.Вставить("ОКПО2", Сред(Строка(ОКПО),2,1));
		ДанныеПечати.Вставить("ОКПО3", Сред(Строка(ОКПО),3,1));
		ДанныеПечати.Вставить("ОКПО4", Сред(Строка(ОКПО),4,1));
		ДанныеПечати.Вставить("ОКПО5", Сред(Строка(ОКПО),5,1));
		ДанныеПечати.Вставить("ОКПО6", Сред(Строка(ОКПО),6,1));
		ДанныеПечати.Вставить("ОКПО7", Сред(Строка(ОКПО),7,1));
		ДанныеПечати.Вставить("ОКПО8", Сред(Строка(ОКПО),8,1));
		
		ДанныеПечати.Вставить("ЮрАдрес", КонтактныеДанные.АдресОрганизации);		
		ДанныеПечати.Вставить("Телефон", КонтактныеДанные.Телефон);
		ДанныеПечати.Вставить("ЭлПочта", КонтактныеДанные.ЭлПочта);
		ДанныеПечати.Вставить("АдресГород", КонтактныеДанные.АдрОбластьГород);		
		
		Индекс = КонтактныеДанные.Индекс;
		
		Если ЗначениеЗаполнено(Индекс) Тогда
			ДанныеПечати.Вставить("ИНД1", Сред(Индекс,1,1));
			ДанныеПечати.Вставить("ИНД2", Сред(Индекс,2,1));
			ДанныеПечати.Вставить("ИНД3", Сред(Индекс,3,1));
			ДанныеПечати.Вставить("ИНД4", Сред(Индекс,4,1));
			ДанныеПечати.Вставить("ИНД5", Сред(Индекс,5,1));
			ДанныеПечати.Вставить("ИНД6", Сред(Индекс,6,1));			
		КонецЕсли;
		
		//ИНН
		ИНН = КонтактныеДанные.ИНН;
		ДанныеПечати.Вставить("ИНН1", Сред(Строка(ИНН),1,1));
		ДанныеПечати.Вставить("ИНН2", Сред(Строка(ИНН),2,1));
		ДанныеПечати.Вставить("ИНН3", Сред(Строка(ИНН),3,1));
		ДанныеПечати.Вставить("ИНН4", Сред(Строка(ИНН),4,1));
		ДанныеПечати.Вставить("ИНН5", Сред(Строка(ИНН),5,1));
		ДанныеПечати.Вставить("ИНН6", Сред(Строка(ИНН),6,1));
		ДанныеПечати.Вставить("ИНН7", Сред(Строка(ИНН),7,1));
		ДанныеПечати.Вставить("ИНН8", Сред(Строка(ИНН),8,1));
		ДанныеПечати.Вставить("ИНН9", Сред(Строка(ИНН),9,1));
		ДанныеПечати.Вставить("ИНН10", Сред(Строка(ИНН),10,1));
		ДанныеПечати.Вставить("ИНН11", Сред(Строка(ИНН),11,1));
		ДанныеПечати.Вставить("ИНН12", Сред(Строка(ИНН),12,1));
		ДанныеПечати.Вставить("ИНН13", Сред(Строка(ИНН),13,1));
		ДанныеПечати.Вставить("ИНН14", Сред(Строка(ИНН),14,1));
		
		ДатаН = Шапка.ДатаНачала;
		ДатаК = Шапка.ДатаОкончания;
		
		// Налоговый период 	
		ДанныеПечати.Вставить("ДатаН1", Сред(Формат(ДатаН,"dd"),1,1));	
		ДанныеПечати.Вставить("ДатаН2", Сред(Формат(ДатаН,"dd"),2,1));	
		ДанныеПечати.Вставить("ДатаН3", Сред(Формат(ДатаН,"MM"),4,1));
		ДанныеПечати.Вставить("ДатаН4", Сред(Формат(ДатаН,"MM"),5,1));
		ДанныеПечати.Вставить("ДатаН5", Сред(Формат(ДатаН,"yyyy"),7,1));
		ДанныеПечати.Вставить("ДатаН6", Сред(Формат(ДатаН,"yyyy"),8,1));
		ДанныеПечати.Вставить("ДатаН7", Сред(Формат(ДатаН,"yyyy"),9,1));
		ДанныеПечати.Вставить("ДатаН8", Сред(Формат(ДатаН,"yyyy"),10,1));
		
		ДанныеПечати.Вставить("ДатаК1", Сред(Формат(ДатаК,"dd"),1,1));
		ДанныеПечати.Вставить("ДатаК2", Сред(Формат(ДатаК,"dd"),2,1));								
		ДанныеПечати.Вставить("ДатаК3", Сред(Формат(ДатаК,"MM"),4,1));
		ДанныеПечати.Вставить("ДатаК4", Сред(Формат(ДатаК,"MM"),5,1));							
		ДанныеПечати.Вставить("ДатаК5", Сред(Формат(ДатаК,"yyyy"),7,1));
		ДанныеПечати.Вставить("ДатаК6", Сред(Формат(ДатаК,"yyyy"),8,1));
		ДанныеПечати.Вставить("ДатаК7", Сред(Формат(ДатаК,"yyyy"),9,1));
		ДанныеПечати.Вставить("ДатаК8", Сред(Формат(ДатаК,"yyyy"),10,1));	

		
		ТаблицаДокумента = Шапка.ОтчетГодовой.Выгрузить();
		КоличествоСтрок = ТаблицаДокумента.Количество();	
		КоличествоЛистов = КоличествоСтрок / 15;
		Если КоличествоЛистов - Цел(КоличествоЛистов) <> 0 Тогда  		
			КоличествоЛистов = Цел(КоличествоЛистов) + 1;
		КонецЕсли;
		
		// Номера страниц
		ДанныеПечати.Вставить("КолЛист1");
		ДанныеПечати.Вставить("КолЛист2");
		ДанныеПечати.Вставить("КолЛист3");
		
		стрКоличествоЛистов = Строка(КоличествоЛистов);
		Если  СтрДлина(стрКоличествоЛистов) = 1 Тогда
			ДанныеПечати.КолЛист3 = Сред(стрКоличествоЛистов,1,1);
		ИначеЕсли СтрДлина(стрКоличествоЛистов) = 2 Тогда
			ДанныеПечати.КолЛист2 = Сред(стрКоличествоЛистов,1,1);
			ДанныеПечати.КолЛист3 = Сред(стрКоличествоЛистов,2,1);
		ИначеЕсли СтрДлина(стрКоличествоЛистов) = 3 Тогда
			ДанныеПечати.КолЛист1 = Сред(стрКоличествоЛистов,1,1);
			ДанныеПечати.КолЛист2 = Сред(стрКоличествоЛистов,2,1);
			ДанныеПечати.КолЛист3 = Сред(стрКоличествоЛистов,3,1);
		КонецЕсли;
		
		ДанныеПечати.Вставить("ВсегоВыплаченноДохода", ТаблицаДокумента.Итог("ВсегоВыплаченноДохода"));
		ДанныеПечати.Вставить("СуммаПН", ТаблицаДокумента.Итог("СуммаПН"));
		ДанныеПечати.Вставить("СуммаМатериальнойВыгоды", ТаблицаДокумента.Итог("СуммаМатериальнойВыгоды"));
		ДанныеПечати.Вставить("СуммаПНСМатериальнойВыгоды", ТаблицаДокумента.Итог("СуммаПНСМатериальнойВыгоды"));
		
		Если Шапка.ВидОтчета = Перечисления.ВидыОтчетаПоНалогам.Первоначальный Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокПервоначальная");
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокУточненная");
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЕсли;	
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры,ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);		
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

Функция ПечатьSTI_058_2Страница(МассивОбъектов, ОбъектыПечати)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка,
		|	ТаблицаДокумента.Номер,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.ДатаНачала,
		|	ТаблицаДокумента.ДатаОкончания,
		|	ТаблицаДокумента.Организация.ИНН КАК ИНН,
		|	ТаблицаДокумента.Организация.КодПоОКПО КАК КодПоОКПО,
		|	ТаблицаДокумента.Организация.ГНС.Наименование КАК ГНСНаименование,
		|	ТаблицаДокумента.Организация.ГНС.Код КАК ГНСКод,
		|	ТаблицаДокумента.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	ТаблицаДокумента.ОтчетГодовой.(
		|		НомерСтроки,
		|		ФизЛицо,
		|		ИНН,
		|		КодДохода,
		|		ВсегоВыплаченноДохода,
		|		СуммаПН,
		|		СуммаМатериальнойВыгоды,
		|		СуммаПНСМатериальнойВыгоды
		|	)
		|ИЗ
		|	Документ.ОтчетПоВыплатамИУдержаниямПН КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";

	Запрос = Новый Запрос(ТекстЗапроса);	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_STI_058_2Страница";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоВыплатамИУдержаниямПН.ПФ_MXL_STI_058_2Страница");
	
	Пока Шапка.Следующий() Цикл
		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Подготовка данных
		ДанныеПечати = Новый Структура;	
		ДанныеПечати.Вставить("КолЛист3");
		
		ОбластьЗаголовокЛ2 	= Макет.ПолучитьОбласть("ЗаголовокЛ2");	
		ОбластьЗаголовокЛЗ 	= Макет.ПолучитьОбласть("ЗаголовокЛЗ");	
		ОбластьШапка 		= Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока		= Макет.ПолучитьОбласть("СтрокаОтчета");
		ОбластьПодвал 		= Макет.ПолучитьОбласть("Подвал");
		ОбластьИтого 		= Макет.ПолучитьОбласть("Итого");
		
		ТаблицаДокумента = Шапка.ОтчетГодовой.Выгрузить();
		КоличествоСтрок = ТаблицаДокумента.Количество();	
		КоличествоЛистов = КоличествоСтрок / 15;
		Если КоличествоЛистов - Цел(КоличествоЛистов) <> 0 Тогда  		
			КоличествоЛистов = Цел(КоличествоЛистов) + 1;
		КонецЕсли;
		
		// Заголовок стр. 2	
		НомерЛиста = 1;
		
		Если НомерЛиста = КоличествоЛистов Тогда
			ДанныеПечати.КолЛист3 = НомерЛиста;
			ОбластьЗаголовокЛЗ.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьЗаголовокЛЗ);
		Иначе 
			ДанныеПечати.КолЛист3 = НомерЛиста;
			ОбластьЗаголовокЛ2.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьЗаголовокЛ2);		
		КонецЕсли;

		// Заполнение шапки
		ДанныеПечати.Вставить("НаименованиеОрганизации", СокрЛП(Шапка.ОрганизацияНаименованиеПолное));
		
		ГНСКод = Шапка.ГНСКод;
		ДанныеПечати.Вставить("ГНС1", Сред(Строка(ГНСКод),1,1));
		ДанныеПечати.Вставить("ГНС2", Сред(Строка(ГНСКод),2,1));
		ДанныеПечати.Вставить("ГНС3", Сред(Строка(ГНСКод),3,1));
		
		ДанныеПечати.Вставить("НаименованиеНалоговой", Шапка.ГНСНаименование);
		
		ОКПО = Шапка.КодПоОКПО;
		ДанныеПечати.Вставить("ОКПО1", Сред(Строка(ОКПО),1,1));
		ДанныеПечати.Вставить("ОКПО2", Сред(Строка(ОКПО),2,1));
		ДанныеПечати.Вставить("ОКПО3", Сред(Строка(ОКПО),3,1));
		ДанныеПечати.Вставить("ОКПО4", Сред(Строка(ОКПО),4,1));
		ДанныеПечати.Вставить("ОКПО5", Сред(Строка(ОКПО),5,1));
		ДанныеПечати.Вставить("ОКПО6", Сред(Строка(ОКПО),6,1));
		ДанныеПечати.Вставить("ОКПО7", Сред(Строка(ОКПО),7,1));
		ДанныеПечати.Вставить("ОКПО8", Сред(Строка(ОКПО),8,1));
				
		//ИНН
		ИНН = Шапка.ИНН;
		ДанныеПечати.Вставить("ИНН1", Сред(Строка(ИНН),1,1));
		ДанныеПечати.Вставить("ИНН2", Сред(Строка(ИНН),2,1));
		ДанныеПечати.Вставить("ИНН3", Сред(Строка(ИНН),3,1));
		ДанныеПечати.Вставить("ИНН4", Сред(Строка(ИНН),4,1));
		ДанныеПечати.Вставить("ИНН5", Сред(Строка(ИНН),5,1));
		ДанныеПечати.Вставить("ИНН6", Сред(Строка(ИНН),6,1));
		ДанныеПечати.Вставить("ИНН7", Сред(Строка(ИНН),7,1));
		ДанныеПечати.Вставить("ИНН8", Сред(Строка(ИНН),8,1));
		ДанныеПечати.Вставить("ИНН9", Сред(Строка(ИНН),9,1));
		ДанныеПечати.Вставить("ИНН10", Сред(Строка(ИНН),10,1));
		ДанныеПечати.Вставить("ИНН11", Сред(Строка(ИНН),11,1));
		ДанныеПечати.Вставить("ИНН12", Сред(Строка(ИНН),12,1));
		ДанныеПечати.Вставить("ИНН13", Сред(Строка(ИНН),13,1));
		ДанныеПечати.Вставить("ИНН14", Сред(Строка(ИНН),14,1));
		
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		// Вывод таблицы
		Счетчик = 0;                  	
		ВсегоВыведеноСтрок = 0;
		СтрокНаЛисте = 0; 	
		
		ВсегоВыплаченноДохода = 0;
		СуммаПН          = 0;
		СуммаМатериальнойВыгоды 	= 0;
		СуммаПНСМатериальнойВыгоды 	= 0;
			
		Для Каждого СтрокаТаблицы Из ТаблицаДокумента Цикл
			
			Если Счетчик <= 14 Тогда
				ОбластьСтрока.Параметры.Заполнить(СтрокаТаблицы);
				
				СтруктураПараметровИННФЛ = НоваяСтруктураПараметровИННФЛ();
				// ИНН ФЛ
				Если ЗначениеЗаполнено(СтрокаТаблицы.ИНН) Тогда 
									
					ИНН = СтрокаТаблицы.ИНН;
					СтруктураПараметровИННФЛ.ИНН1   = Сред(Строка(ИНН),1,1);
					СтруктураПараметровИННФЛ.ИНН2   = Сред(Строка(ИНН),2,1);
					СтруктураПараметровИННФЛ.ИНН3   = Сред(Строка(ИНН),3,1);
					СтруктураПараметровИННФЛ.ИНН4   = Сред(Строка(ИНН),4,1);
					СтруктураПараметровИННФЛ.ИНН5   = Сред(Строка(ИНН),5,1);
					СтруктураПараметровИННФЛ.ИНН6   = Сред(Строка(ИНН),6,1);
					СтруктураПараметровИННФЛ.ИНН7   = Сред(Строка(ИНН),7,1);
					СтруктураПараметровИННФЛ.ИНН8   = Сред(Строка(ИНН),8,1);
					СтруктураПараметровИННФЛ.ИНН9   = Сред(Строка(ИНН),9,1);
					СтруктураПараметровИННФЛ.ИНН10  = Сред(Строка(ИНН),10,1);
					СтруктураПараметровИННФЛ.ИНН11  = Сред(Строка(ИНН),11,1);
					СтруктураПараметровИННФЛ.ИНН12  = Сред(Строка(ИНН),12,1);
					СтруктураПараметровИННФЛ.ИНН13  = Сред(Строка(ИНН),13,1);
					СтруктураПараметровИННФЛ.ИНН14  = Сред(Строка(ИНН),14,1);
					
				КонецЕсли;
				
				ВсегоВыплаченноДохода = ВсегоВыплаченноДохода + СтрокаТаблицы.ВсегоВыплаченноДохода;
				СуммаПН          = СуммаПН + СтрокаТаблицы.СуммаПН;
				СуммаМатериальнойВыгоды 	= СуммаМатериальнойВыгоды + СтрокаТаблицы.СуммаМатериальнойВыгоды;
				СуммаПНСМатериальнойВыгоды	= СуммаПНСМатериальнойВыгоды + СтрокаТаблицы.СуммаПНСМатериальнойВыгоды;
				
				ОбластьСтрока.Параметры.Заполнить(СтруктураПараметровИННФЛ);
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				
				ВсегоВыведеноСтрок = ВсегоВыведеноСтрок + 1;
				СтрокНаЛисте = СтрокНаЛисте + 1; 
				
			ИначеЕсли Счетчик > 13 Тогда 
				Счетчик = 0;
				СтрокНаЛисте = 0;
				НомерЛиста = НомерЛиста + 1;
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("ВсегоВыплаченноДохода", ВсегоВыплаченноДохода);
				СтруктураПараметров.Вставить("СуммаПН", СуммаПН);
				СтруктураПараметров.Вставить("СуммаМатериальнойВыгоды", СуммаМатериальнойВыгоды);
				СтруктураПараметров.Вставить("СуммаПНСМатериальнойВыгоды", СуммаПНСМатериальнойВыгоды);

				СтруктураПараметров.Вставить("КолЛист1");
				СтруктураПараметров.Вставить("КолЛист2");
				СтруктураПараметров.Вставить("КолЛист3");	
				
				// Итоги на странице
				ОбластьИтого.Параметры.Заполнить(СтруктураПараметров);
				ТабличныйДокумент.Вывести(ОбластьИтого);
				
				ВсегоВыплаченноДохода = 0;
				СуммаПН          = 0;
				СуммаМатериальнойВыгоды 	= 0;
				СуммаПНСМатериальнойВыгоды 	= 0;
				
				ТабличныйДокумент.Вывести(ОбластьПодвал);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
				// Вывод ЗаклюЧительного Листа	
				
				Если НомерЛиста = КоличествоЛистов Тогда
					стрНомерЛиста =  Строка(НомерЛиста);
					Если  СтрДлина(стрНомерЛиста) = 1 Тогда
						СтруктураПараметров.КолЛист3 = Сред(стрНомерЛиста,1,1);
					ИначеЕсли СтрДлина(стрНомерЛиста) = 2 Тогда
						СтруктураПараметров.КолЛист2 = Сред(стрНомерЛиста,1,1);
						СтруктураПараметров.КолЛист3 = Сред(стрНомерЛиста,2,1);
					ИначеЕсли СтрДлина(стрНомерЛиста) = 3 Тогда
						СтруктураПараметров.КолЛист1 = Сред(стрНомерЛиста,1,1);
						СтруктураПараметров.КолЛист2 = Сред(стрНомерЛиста,2,1);
						СтруктураПараметров.КолЛист3 = Сред(стрНомерЛиста,3,1);
					КонецЕсли;		
					ОбластьЗаголовокЛЗ.Параметры.Заполнить(СтруктураПараметров);
					ТабличныйДокумент.Вывести(ОбластьЗаголовокЛЗ );
					ТабличныйДокумент.Вывести(ОбластьШапка);
				Иначе 
					
					стрНомерЛиста =  Строка(НомерЛиста);
					Если  СтрДлина(стрНомерЛиста) = 1 Тогда
						СтруктураПараметров.КолЛист3 = Сред(стрНомерЛиста,1,1);
					ИначеЕсли СтрДлина(стрНомерЛиста) = 2 Тогда
						СтруктураПараметров.КолЛист2 = Сред(стрНомерЛиста,1,1);
						СтруктураПараметров.КолЛист3 = Сред(стрНомерЛиста,2,1);
					ИначеЕсли СтрДлина(стрНомерЛиста) = 3 Тогда
						СтруктураПараметров.КолЛист1 = Сред(стрНомерЛиста,1,1);
						СтруктураПараметров.КолЛист2 = Сред(стрНомерЛиста,2,1);
						СтруктураПараметров.КолЛист3 = Сред(стрНомерЛиста,3,1);
					КонецЕсли;	
					ОбластьЗаголовокЛ2.Параметры.Заполнить(СтруктураПараметров);
					ТабличныйДокумент.Вывести(ОбластьЗаголовокЛ2);
					ТабличныйДокумент.Вывести(ОбластьШапка);
				КонецЕсли;
				
				ОбластьСтрока.Параметры.Заполнить(СтрокаТаблицы);
				
				СтруктураПараметровИННФЛ = НоваяСтруктураПараметровИННФЛ();
				// ИНН ФЛ
				Если ЗначениеЗаполнено(СтрокаТаблицы.ИНН) Тогда 
									
					ИНН = СтрокаТаблицы.ИНН;
					СтруктураПараметровИННФЛ.ИНН1   = Сред(Строка(ИНН),1,1);
					СтруктураПараметровИННФЛ.ИНН2   = Сред(Строка(ИНН),2,1);
					СтруктураПараметровИННФЛ.ИНН3   = Сред(Строка(ИНН),3,1);
					СтруктураПараметровИННФЛ.ИНН4   = Сред(Строка(ИНН),4,1);
					СтруктураПараметровИННФЛ.ИНН5   = Сред(Строка(ИНН),5,1);
					СтруктураПараметровИННФЛ.ИНН6   = Сред(Строка(ИНН),6,1);
					СтруктураПараметровИННФЛ.ИНН7   = Сред(Строка(ИНН),7,1);
					СтруктураПараметровИННФЛ.ИНН8   = Сред(Строка(ИНН),8,1);
					СтруктураПараметровИННФЛ.ИНН9   = Сред(Строка(ИНН),9,1);
					СтруктураПараметровИННФЛ.ИНН10  = Сред(Строка(ИНН),10,1);
					СтруктураПараметровИННФЛ.ИНН11  = Сред(Строка(ИНН),11,1);
					СтруктураПараметровИННФЛ.ИНН12  = Сред(Строка(ИНН),12,1);
					СтруктураПараметровИННФЛ.ИНН13  = Сред(Строка(ИНН),13,1);
					СтруктураПараметровИННФЛ.ИНН14  = Сред(Строка(ИНН),14,1);
					
				КонецЕсли;
				
				ВсегоВыплаченноДохода = ВсегоВыплаченноДохода + СтрокаТаблицы.ВсегоВыплаченноДохода;
				СуммаПН          = СуммаПН + СтрокаТаблицы.СуммаПН;
				СуммаМатериальнойВыгоды 	= СуммаМатериальнойВыгоды + СтрокаТаблицы.СуммаМатериальнойВыгоды;
				СуммаПНСМатериальнойВыгоды	= СуммаПНСМатериальнойВыгоды + СтрокаТаблицы.СуммаПНСМатериальнойВыгоды;
			
				ОбластьСтрока.Параметры.Заполнить(СтруктураПараметровИННФЛ);
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				ВсегоВыведеноСтрок = ВсегоВыведеноСтрок + 1;
				
				СтрокНаЛисте = СтрокНаЛисте + 1; 
				
			КонецЕсли;
			
			Счетчик = Счетчик + 1;
			
		КонецЦикла;
		
		НехваткаНаЛист = 14 - СтрокНаЛисте;
		
		Пока НехваткаНаЛист > 0 Цикл
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаОтчета");
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			НехваткаНаЛист = НехваткаНаЛист - 1 ;
		КонецЦикла;
		
		// Итоги на странице
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ВсегоВыплаченноДохода", ВсегоВыплаченноДохода);
		СтруктураПараметров.Вставить("СуммаПН", СуммаПН);
		СтруктураПараметров.Вставить("СуммаМатериальнойВыгоды", СуммаМатериальнойВыгоды);
		СтруктураПараметров.Вставить("СуммаПНСМатериальнойВыгоды", СуммаПНСМатериальнойВыгоды);
		
		ОбластьИтого.Параметры.Заполнить(СтруктураПараметров);
		ТабличныйДокумент.Вывести(ОбластьИтого);
		
		// Итоги ВСЕГО, Если это заключительный лист
		Если НомерЛиста = КоличествоЛистов Тогда
			ОбластьВсего = Макет.ПолучитьОбласть("Всего");
			
			ДанныеПечати.Вставить("ВсегоВыплаченноДохода", ТаблицаДокумента.Итог("ВсегоВыплаченноДохода"));
			ДанныеПечати.Вставить("СуммаПН", ТаблицаДокумента.Итог("СуммаПН"));
			ДанныеПечати.Вставить("СуммаМатериальнойВыгоды", ТаблицаДокумента.Итог("СуммаМатериальнойВыгоды"));
			ДанныеПечати.Вставить("СуммаПНСМатериальнойВыгоды", ТаблицаДокумента.Итог("СуммаПНСМатериальнойВыгоды"));

			ЗаполнитьЗначенияСвойств(ОбластьВсего.Параметры,ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьВсего);	
			
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);		
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_STI_017_1Страница") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"ПФ_MXL_STI_017_1Страница", 
		"Отчет STI-017", 
		ПечатьSTI_017_1Страница(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ОтчетПоВыплатамИУдержаниямПН.ПФ_MXL_STI_017_1Страница");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_STI_017_2Страница") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"ПФ_MXL_STI_017_2Страница", 
		"Отчет STI-017 (приложение)", 
		ПечатьSTI_017_2Страница(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ОтчетПоВыплатамИУдержаниямПН.ПФ_MXL_STI_017_2Страница");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_STI_058_1Страница") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"ПФ_MXL_STI_058_1Страница", 
		"Отчет STI-058", 
		ПечатьSTI_058_1Страница(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ОтчетПоВыплатамИУдержаниямПН.ПФ_MXL_STI_058_1Страница");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_STI_058_2Страница") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"ПФ_MXL_STI_058_2Страница", 
		"Отчет STI-058 (приложение)", 
		ПечатьSTI_058_2Страница(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ОтчетПоВыплатамИУдержаниямПН.ПФ_MXL_STI_058_2Страница");
	КонецЕсли;

КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_STI_017_1Страница";
	КомандаПечати.Представление = НСтр("ru = 'Отчет STI-017'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Порядок = 1;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "Годовой", Ложь);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_STI_017_2Страница";
	КомандаПечати.Представление = НСтр("ru = 'Отчет STI-017 (приложение)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Порядок = 2;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "Годовой", Ложь);

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_STI_058_1Страница";
	КомандаПечати.Представление = НСтр("ru = 'Отчет STI-058'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Порядок = 3;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "Годовой", Истина);

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_STI_058_2Страница";
	КомандаПечати.Представление = НСтр("ru = 'Отчет STI-058 (приложение)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Порядок = 4;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "Годовой", Истина);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
